Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/pwr/netmf_pwr.cpp

/*

STM32F1x Microframework power HAL driver

Nathan Stohs
nathan.stohs@samraksh.com

*/

#include "netmf_pwr.h"
#include "netmf_pwr_wakelock.h"
#include "../usart/sam_usart.h"
#include "../Timer/netmf_rtc/netmf_rtc.h"

//#undef POWER_PROFILE_HACK

#ifdef POWER_PROFILE_HACK
//#define POWER_TABLE_WRAP

//#define FILTER_WAKELOCK_DENY
#define FILTER_LOCKON
#define FILTER_LOCKOFF
//#define FILTER_TOO_SHORT
//#define FILTER_SNOOZE
//#define FILTER_USART
#define FILTER_GC_RELOC
#define FILTER_EXE_ST

#define POWER_MERGE_MANAGED
#define POWER_MERGE_GC

#define POWER_EVENTS_SIZE 512
#define POWER_COUNT_INIT 0
#define POWER_COUNT_TIME (90*16384) // Don't start logging until RTC is X

static IRQn_Type get_first_irq(void);

typedef struct __attribute__ ((packed)) {
	uint32_t time;
	uint16_t data16;
	//int8_t misc1;
	power_event_enum_t evt;
} power_event_t;

static power_event_t power_events[POWER_EVENTS_SIZE];
static int power_count = POWER_COUNT_INIT;

static const char* power_evt_to_string(power_event_enum_t x) {
	switch (x) {
		case GOING_TO_SLEEP:	return "SLEEP";
		case WAKEUP:			return "WAKEUP";
		case TOO_SHORT: 		return "TOO_SHORT";
		case WAKELOCK_ON: 		return "LOCK_ON";
		case WAKELOCK_OFF: 		return "LOCK_OFF";
		case WAKELOCK_DENY_START: 	return "WAKELOCK_DENY_START";
		case WAKELOCK_DENY_END: 	return "WAKELOCK_DENY_END";
		case TIMEWARP: 			return "TIMEWARP";
		case SNOOZE:			return "SNOOZE";
		case BUSY_ISR:			return "BUSY_ISR";
		case BUSY_USART:		return "BUSY_USART";
		case MANAGED_ENTER:		return "MANAGED_ENTER";
		case MANAGED_EXIT:		return "MANAGED_EXIT";
		case GC_START:			return "GC_START";
		case GC_END:			return "GC_END";
		case GC_RELOC_START:	return "GC_RELOC_START";
		case GC_RELOC_END:		return "GC_RELOC_END";
		case EXE_ST_GO:			return "EXE_ST_GO";
		case EXE_ST_END:		return "EXE_ST_END";
		case EXE_DBG_GO:		return "EXE_DBG_GO";
		case EXE_DBG_END:		return "EXE_DBG_END";
		case EXE_WA_GO:			return "EXE_WA_GO";
		case EXE_WA_END:		return "EXE_WA_END";
		case E_WFE_S:			return "E_WFE_S";
		case E_WFE_E:			return "E_WFE_E";
		case EVENT_CONT_S:		return "EVENT_CONT_S";
		case EVENT_CONT_E:		return "EVENT_CONT_E";
		case EVENT_WFI_S:		return "EVENT_WFI_S";
		case EVENT_WFI_E:		return "EVENT_WFI_E";
		case EVENT_PROBE_E:		return "EVENT_PROBE_E";
		case COMP_VT_QUEUE:		return "COMP_VT_QUEUE";
		case COMP_WAITIME:		return "COMP_WAITIME";
		case COMP_RESETSET:		return "COMP_RESETSET";
		default:				return "UNKNOWN";
	}
}

static void print_power_event(power_event_t e) {
	hal_printf("%d %d %s 0\r\n", e.time, e.data16, power_evt_to_string(e.evt) /*, e.misc1*/);
}

// Only do this on wakeup for known state
static void print_all_power_events() {
	//TIM_Cmd(TIM1, DISABLE);
	//SOFT_BREAKPOINT();
	__enable_irq();
	for(int i=0; i<POWER_EVENTS_SIZE; i++) {
		print_power_event(power_events[i]);
	}
	hal_printf("%d\r\n", RTC_GetCounter());
	while(1); // never return;
}

static void power_event_sleep(uint32_t now, uint16_t wakeup, enum stm_power_modes power_state) {
	if (RTC_GetCounter() < POWER_COUNT_TIME) { return; }
	if (power_count < 0) { power_count++; return; }
	if (power_count >= POWER_EVENTS_SIZE) { return; }
	power_events[power_count].time = now;
	power_events[power_count].data16 = wakeup;
	power_events[power_count].evt = GOING_TO_SLEEP;

	// int8_t misc1;
	// switch(power_state) {
		// case POWER_STATE_DEFAULT: 		misc1 = 0; break;
		// case POWER_STATE_LOW:			misc1 = 1; break;
		// case POWER_STATE_MID:			misc1 = 2; break;
		// case POWER_STATE_HIGH:			misc1 = 3; break;
		// case POWER_STATE_GOING_SLEEP:	misc1 = 4; break;
		// default:						misc1 = 5; break;
	// }
	// power_events[power_count].misc1 = misc1;
	power_count++;
#ifdef POWER_TABLE_WRAP
	if (power_count >= POWER_EVENTS_SIZE)
		power_count=0;
#endif
}

static void power_event_add(uint32_t now, power_event_enum_t evt, uint16_t data16, int8_t extra) {
	if (RTC_GetCounter() < POWER_COUNT_TIME) { return; }
	if (power_count < 0 || power_count >= POWER_EVENTS_SIZE) { return; }
	if (power_count >= POWER_EVENTS_SIZE) { print_all_power_events(); return; }
	
	switch (evt) {
#ifdef FILTER_EXE_ST
		case EXE_ST_GO:
		case EXE_ST_END:
#endif
#ifdef FILTER_GC_RELOC
		case GC_RELOC_START:
		case GC_RELOC_END:
#endif
#ifdef FILTER_WAKELOCK_DENY
		case WAKELOCK_DENY_START:
		case WAKELOCK_DENY_END:
#endif
#ifdef FILTER_LOCKOFF
		case WAKELOCK_OFF:
#endif
#ifdef FILTER_LOCKON
		case WAKELOCK_ON:
#endif
#ifdef FILTER_TOO_SHORT
		case TOO_SHORT:
#endif
#ifdef FILTER_SNOOZE
		case SNOOZE:
#endif
#ifdef FILTER_USART
		case BUSY_USART:
#endif
		return;
		default: break;
	}

	// If we just exited but are entering again, forget the last exit and this entrance
#ifdef POWER_MERGE_MANAGED
	if (power_count > 0 && evt == MANAGED_ENTER && power_events[power_count-1].evt == MANAGED_EXIT) {
		power_count--;
		return;
	}
#endif

#ifdef POWER_MERGE_GC
	if (power_count > 0 && evt == GC_START && power_events[power_count-1].evt == GC_END) {
		power_count--;
		return;
	}
#endif

	power_events[power_count].time = now;
	power_events[power_count].data16 = data16;
	power_events[power_count].evt = evt;
	//power_events[power_count].misc1 = extra;
	power_count++;
#ifdef POWER_TABLE_WRAP
	if (power_count >= POWER_EVENTS_SIZE)
		power_count=0;
#endif
}

void power_event_add_now(power_event_enum_t evt, uint16_t data16, int8_t extra) {
	power_event_add(RTC_GetCounter(), evt, data16, extra);
}

static void power_event_wakeup(uint32_t now) {
	if (RTC_GetCounter() < POWER_COUNT_TIME) { return; }
	if (power_count < 0) { power_count++; return; }
	if (power_count >= POWER_EVENTS_SIZE) { print_all_power_events(); return; }
	power_events[power_count].time = now;
	power_events[power_count].evt = WAKEUP;
	power_events[power_count].data16 = (uint16_t)get_first_irq();
	power_count++;
#ifdef POWER_TABLE_WRAP
	if (power_count >= POWER_EVENTS_SIZE)
		power_count=0;
#endif
}

#endif

// Number of RTC ticks it takes to wakeup from each power level.
// So wakeup early by this amount plus some slop
// enum wakeup_ticks{
	// MIN_SLEEP_TICKS = 33,
	// SLEEP_EXTRA_PAD = 2,
	// SLEEP_PADDING_HIGH_POWER = 9,
	// SLEEP_PADDING_MID_POWER = 9,
	// SLEEP_PADDING_LOW_POWER = 6,
// };
enum wakeup_ticks{
	MIN_SLEEP_TICKS = 17,
	SLEEP_EXTRA_PAD = 2,
	SLEEP_PADDING_HIGH_POWER = 5,
	SLEEP_PADDING_MID_POWER = 5,
	SLEEP_PADDING_LOW_POWER = 3,
};

#ifdef PLATFORM_ARM_AUSTERE
#include <stm32f10x.h>
#endif

static int pwr_hsi_clock_measure;
static int pwr_hsi_clock_measure_orig;
static enum stm_power_modes stm_power_state = POWER_STATE_DEFAULT;

#ifdef PLATFORM_ARM_AUSTERE
static void power_supply_reset() {
  GPIO_InitTypeDef GPIO_InitStructure;
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_11 | GPIO_Pin_13; // leave out PC8 due to schematic issues
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
  GPIO_Init(GPIOC, &GPIO_InitStructure);

  // Configure Inputs
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7 | GPIO_Pin_12;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU; //
  GPIO_Init(GPIOC, &GPIO_InitStructure);

  // Configure Inputs
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU; // PB5 is open-drain from LTC3103
  GPIO_Init(GPIOB, &GPIO_InitStructure);

  // Configure Inputs
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(GPIOC, &GPIO_InitStructure);

