Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/pwr/netmf_pwr.cpp
  // Radio shutdown pin
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
}

// AUSTERE. ONLY GPIOC and FOR IPU/IPD (i.e. not for 3.3v ctrl which uses OD logic)
static void power_supply_activate(uint16_t pin) {
  GPIO_InitTypeDef GPIO_InitStructure;
  GPIO_InitStructure.GPIO_Pin = pin;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
}
// 0 = Cap not rady, 1 = Cap Ready
static int get_radio_charge_status(void) {
	return GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_12);
}
static int get_radio_power_status(void) {
	return GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_7);
}
static void radio_shutdown(int go) {
	if (go) // turn off the radio
		GPIO_WriteBit(GPIOB, GPIO_Pin_11, Bit_SET);
	else
		GPIO_WriteBit(GPIOB, GPIO_Pin_11, Bit_RESET);
}
#endif // PLATFORM_ARM_AUSTERE


#ifdef EMOTE_WAKELOCKS
static uint32_t wakelock;
static UINT64 waketime;

void WakeLockInit(void) {
	wakelock = 0;
#if defined (EMOTE_WAKELOCK_STARTUP) && (EMOTE_WAKELOCK_STARTUP > 0)
	waketime = HAL_Time_CurrentTicks() + CPU_MicrosecondsToTicks((UINT32)1000000 * EMOTE_WAKELOCK_STARTUP);
#else
	waketime = 0;
#endif
}

void WakeLock(uint32_t lock) {
#ifdef POWER_PROFILE_HACK
	power_event_add(RTC_GetCounter(), WAKELOCK_ON, lock, -1);
#endif
	GLOBAL_LOCK(irq);
	wakelock |= lock;
}

void WakeUnlock(uint32_t lock) {
#ifdef POWER_PROFILE_HACK
	power_event_add(RTC_GetCounter(), WAKELOCK_OFF, lock, -1);
#endif
	GLOBAL_LOCK(irq);
	wakelock &= ~lock;
}

void WakeUntil(UINT64 until) {
	UINT64 now;

	GLOBAL_LOCK(irq);

	// Value of 0 will force kill the wakelock
	if (until == 0) {
		waketime = 0;
		return;
	}

	now = HAL_Time_CurrentTicks();

	// Make sure time is valid (in the future)
	// Make sure time is not before previous time.
	if (until < now || until < waketime) {
		return;
	}

	waketime = until;
}

bool GetWakeLocked(void) {
	bool doWFI;
	ASSERT_IRQ_MUST_BE_OFF();
	if (wakelock) { doWFI = TRUE; }
	else if (waketime > 0) {
		UINT64 now = HAL_Time_CurrentTicks();
		if (waketime >= now) {
			doWFI = TRUE; // Wakelocked
		} else {
			waketime = 0;
			doWFI = FALSE;
		}
	} else { doWFI = FALSE; }
	return doWFI;
}

#else // EMOTE_WAKELOCKS
void WakeLock(uint32_t lock) {}
void WakeUnlock(uint32_t lock) {}
void WakeUntil(UINT64 until) {}
bool GetWakeLocked(void) {return false;}
void WakeLockInit(void) {}
#endif // EMOTE_WAKELOCKS

#ifdef DEBUG_DOTNOW_ISR
extern volatile unsigned interrupt_count[64];
#endif

// Doesn't have to do anything but it does cause wakeup.
extern "C" {
void __irq RTCAlarm_IRQHandler(void) {
	//SOFT_BREAKPOINT();
#ifdef DEBUG_DOTNOW_ISR
	interrupt_count[RTCAlarm_IRQn]++;
#endif
	RTC_ClearITPendingBit(RTC_IT_ALR);
	EXTI_ClearITPendingBit(EXTI_Line17);
}
}

static void rtc_alr_evt_enable(void) {
	EXTI_InitTypeDef EXTI_InitStruct;
	EXTI_InitStruct.EXTI_Line = EXTI_Line17;
	EXTI_InitStruct.EXTI_Mode = EXTI_Mode_Event;
	EXTI_InitStruct.EXTI_Trigger = EXTI_Trigger_Rising;
	EXTI_InitStruct.EXTI_LineCmd = ENABLE;
	EXTI_Init(&EXTI_InitStruct);
}

static void rtc_alr_evt_disable(void) {
	EXTI_InitTypeDef EXTI_InitStruct;
	EXTI_InitStruct.EXTI_Line = EXTI_Line17;
	EXTI_InitStruct.EXTI_Mode = EXTI_Mode_Event;
	EXTI_InitStruct.EXTI_Trigger = EXTI_Trigger_Rising;
	EXTI_InitStruct.EXTI_LineCmd = DISABLE;
	EXTI_Init(&EXTI_InitStruct);
}

static void RTC_wakeup_init(void) {
	EXTI_InitTypeDef EXTI_InitStruct;
	NVIC_InitTypeDef NVIC_InitStruct;

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO , ENABLE);
	EXTI_DeInit();

	EXTI_ClearITPendingBit(EXTI_Line17);
	// EXTI_InitStruct.EXTI_Line = EXTI_Line17;
	// EXTI_InitStruct.EXTI_Mode = EXTI_Mode_Event;
	// EXTI_InitStruct.EXTI_Trigger = EXTI_Trigger_Rising;
	// EXTI_InitStruct.EXTI_LineCmd = DISABLE;
	// EXTI_Init(&EXTI_InitStruct);

	// Setup RTC Alarm interrupt (for wakeup)
	// NVIC_InitStruct.NVIC_IRQChannel = RTCAlarm_IRQn;
	// NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 0;
	// NVIC_InitStruct.NVIC_IRQChannelSubPriority = 0;
	// NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
	// NVIC_Init(&NVIC_InitStruct);
}

void PowerInit() {
	GLOBAL_LOCK(irq);
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR | RCC_APB1Periph_BKP, ENABLE);
	BKP_DeInit();


#if !defined(BUILD_RTM) // For non-RTM flavors (e.g. Release, Debug), do not artificially raise lowest power mode. But, in flavors Debug, Instrumented ...
	if(JTAG_Attached() > 0) // ... when JTAG is attached, artificially raise lowest power mode to support JTAG connection.
	{
	DBGMCU_Config(DBGMCU_SLEEP | DBGMCU_STANDBY | DBGMCU_STOP, ENABLE);
	}
	else {
#endif
	DBGMCU_Config(DBGMCU_SLEEP | DBGMCU_STANDBY | DBGMCU_STOP, DISABLE);
#if !defined(BUILD_RTM)
	}
#endif

#if defined(DOTNOW_HSI_CALIB) && !defined(PLATFORM_ARM_AUSTERE)
	Low_Power();
	CalibrateHSI();
#endif


#ifdef PLATFORM_ARM_AUSTERE
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB | RCC_APB2Periph_GPIOC, ENABLE);
	power_supply_reset();
	power_supply_activate(GPIO_Pin_6); // 1.8v rail (with the RTC clock)
	// Spin long enough for the 1.8v domain to power up. This delay is a mostly blind guess.
	for(volatile int i=0; i<106666; i++) ; // spin, maybe about 10ms ???
	power_supply_activate(GPIO_Pin_11);    // Big Cap

	Low_Power();
	CalibrateHSI(); // Lets calibrate the HSI while we wait for the cap to charge.

#ifdef AUSTERE_NO_CAP_TIMEOUT
	while( get_radio_charge_status() == 0 ); 	// wait for big cap to charge
#else
	volatile int i=0;
	while(get_radio_charge_status() == 0) {
		if (i++ == 10000000) // ~20 seconds
			break;
	}
#endif

	power_supply_activate(GPIO_Pin_13);			// Turn on 2.5v rail
	radio_shutdown(1);							// Disable radio

	volatile int ii=0;
	while( get_radio_power_status() == 0 ) {		// Wait for 2.5v to stab
		if (ii++ == 10000000) // ~20 seconds
		{ ASSERT(0); break; }
	}

	//Low_Power();
	//Mid_Power(); // Would prefer 8 MHz
	High_Power();
#else
	High_Power();
#endif

	hal_printf("POWER LEVEL: HIGH\r\n");
	RCC_LSICmd(DISABLE);
	RTC_wakeup_init();

