Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/pwr/netmf_pwr.cpp
	WakeLockInit();
}

static void do_hsi_measure() {
	// Re-align
	RTC_ClearFlag(RTC_FLAG_ALR);
	RTC_SetAlarm(RTC_GetCounter()+1);
	while( RTC_GetFlagStatus(RTC_FLAG_ALR) == RESET );

	// Do the measurement
	TIM6->CNT=0;
	RTC_ClearFlag(RTC_FLAG_ALR);
	RTC_SetAlarm(RTC_GetCounter()+1);
	while( RTC_GetFlagStatus(RTC_FLAG_ALR) == RESET );
	pwr_hsi_clock_measure = (TIM6->CNT << 7);
	RTC_ClearFlag(RTC_FLAG_ALR);
}

static void align_to_rtc() {
	uint32_t now = RTC_GetCounter();

	RTC_SetAlarm(++now);

	// Make sure we weren't straddling the RTC clock edge
	if (now == RTC_GetCounter()) {
		RTC_ClearFlag(RTC_FLAG_ALR);
		return;
	}

	// Spin until aligned.
	while( RTC_GetFlagStatus(RTC_FLAG_ALR) == RESET );
	RTC_ClearFlag(RTC_FLAG_ALR);
}

// Returns measured HSI speed if the calibrate function was used.
UINT32 pwr_get_hsi(int x) {
#ifdef DOTNOW_HSI_CALIB
	uint32_t ret;
	switch(x) {
		case 0: ret = pwr_hsi_clock_measure_orig; break;
		case 1: ret = pwr_hsi_clock_measure; break;
		case 2:
		default: ret = PWR_HSI_SPEED;
	}
	return ret;
#else
	return 0;
#endif
}

static int trim_test(uint32_t *hsi_trim_error, uint32_t *hsi_trim_val, uint32_t trim) {
	if (hsi_trim_error[trim] == 0xFFFFFFFF && PWR_HSI_TRIM_VALID(trim)) {
		RCC_AdjustHSICalibrationValue(trim);
		do_hsi_measure();
		//hsi_trim_error[trim] = PWR_ABS( (int)PWR_HSI_SPEED - (int)pwr_hsi_clock_measure );
		hsi_trim_error[trim] = abs( PWR_HSI_SPEED - pwr_hsi_clock_measure );
		hsi_trim_val[trim] = pwr_hsi_clock_measure;
		if (hsi_trim_error[trim] < PWR_HSI_CLOSE_ENOUGH) {
			return 1;
		}
	}
	return 0;
}

// Currently this is only safe to do at startup.
// Not tested for mid program execution.
// No longer uses interrupts. Also Mike is a Farty-pants (and rumor has it a BIG JERK).
void CalibrateHSI() {
	uint32_t trim;
	int err  = 0;
	int skip = 0; 					// if we get close enough, skip rest of tests.
	uint32_t hsi_trim_error[32];	// Memoization table of absolute frequency error vs. TRIM
	uint32_t hsi_trim_val[32];		// Memoization table of absolute frequency vs TRIM

	if (stm_power_state != POWER_STATE_LOW) {
		return; // Must be done from low power mode.
	}

	// Reset tables
	memset(hsi_trim_error, 0xFFFFFFFF, sizeof(hsi_trim_error));
	memset(hsi_trim_val  , 0x00000000, sizeof(hsi_trim_val));

	// First make sure the RTC is running, we will use that to measure.
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR | RCC_APB1Periph_BKP, ENABLE);
	PWR_BackupAccessCmd(ENABLE);
	RTC_SetPrescaler(0x0FFF); // 1/8th second
	//RTC_SetPrescaler(0x0F41); // 1/8th second. Delete me. For a temporary gimped board.
#ifdef PLATFORM_ARM_AUSTERE
	RCC_LSEConfig(RCC_LSE_Bypass);
#else
	RCC_LSEConfig(RCC_LSE_ON);
#endif
	while(RCC_GetFlagStatus(RCC_FLAG_LSERDY) == RESET) {
		if (err++ == PWR_RTC_TIMEOUT) {
			ASSERT(0);
			return; // Crystal not starting. Give up.
		}
	}
	RCC_RTCCLKConfig(RCC_RTCCLKSource_LSE);
	RCC_RTCCLKCmd(ENABLE);
	RTC_WaitForLastTask();
	RTC_WaitForSynchro();
	RTC_WaitForLastTask();
	RCC_LSICmd(DISABLE);

	pwr_hsi_clock_measure = 0;
	pwr_hsi_clock_measure_orig = 0;

	// Setup TIM6 to do the actual timing
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM6, ENABLE);
	TIM_DeInit(TIM6);
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStruct;
	TIM_TimeBaseStructInit(&TIM_TimeBaseInitStruct);
	TIM_TimeBaseInitStruct.TIM_Prescaler = 15;
	TIM_TimeBaseInit(TIM6, &TIM_TimeBaseInitStruct);

	TIM_Cmd(TIM6, ENABLE);

	trim = BKP_ReadBackupRegister(BKP_DR1); // backup register 1 contains last good TRIM value
	if ( !PWR_HSI_TRIM_VALID(trim) ) {
		trim = PWR_HSI_DEFAULT_TRIM;
	}

	// Wait 1 tick so we are reasonably sure we are close to RTC clock edge. Keeps things clean.
	align_to_rtc();

	// Find trim with min error.
	// Note implicit assumptions about clock speed and TRIM relationship (not random).
	// STARTING GUESS MUST BE GOOD. DOES NOT WORK FROM ANY GIVEN BASE. THERE ARE LOCAL MINIMA.
	// SO WE MUST ALWAYS CHECK DEFAULT AS A STARTING "GOOD" GUESS.

	// Test Hardware defaults (trim==16)
	skip = trim_test(hsi_trim_error, hsi_trim_val, PWR_HSI_DEFAULT_TRIM);

	while( PWR_HSI_TRIM_VALID(trim) ) {
		unsigned min_trim = trim;

		if (!skip) { skip = trim_test(hsi_trim_error, hsi_trim_val, trim);   }
		if (!skip) { skip = trim_test(hsi_trim_error, hsi_trim_val, trim-1); }
		if (!skip) { skip = trim_test(hsi_trim_error, hsi_trim_val, trim+1); }

		// Find min error
		if (hsi_trim_error[min_trim] > hsi_trim_error[trim+1]) {
			min_trim = trim+1;
		}
		else if (hsi_trim_error[min_trim] > hsi_trim_error[trim-1]) {
			min_trim = trim-1;
		}

		// Always sanity check against default value due to local-minima problem
		// Must loop at least one more time as well.
		if (hsi_trim_error[min_trim] > hsi_trim_error[PWR_HSI_DEFAULT_TRIM]) {
			min_trim = PWR_HSI_DEFAULT_TRIM;
		}
		else if (min_trim == trim || skip || PWR_HSI_TRIM_MIN_OR_MAX(min_trim) ) {
			RCC_AdjustHSICalibrationValue(min_trim);
			pwr_hsi_clock_measure = hsi_trim_val[min_trim];
			BKP_WriteBackupRegister(BKP_DR1, (uint16_t)min_trim);
			break;
		}
		// go around and try again
		trim = min_trim;
	}

	pwr_hsi_clock_measure_orig = hsi_trim_val[PWR_HSI_DEFAULT_TRIM];

	// Clean up
	TIM_DeInit(TIM6);
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM6, DISABLE);
	PWR_BackupAccessCmd(DISABLE);
	// Turn off RTC since not used currently.
	RCC_RTCCLKCmd(DISABLE);
	RCC_LSEConfig(RCC_LSE_OFF);
	// Leave PWR module ON.
	RCC_APB1PeriphClockCmd(/*RCC_APB1Periph_PWR |*/ RCC_APB1Periph_BKP, DISABLE);
}

// Block and pause until clock-sensitive peripherals are ready.
// Add to this list as needed.
static void pause_peripherals(void) {
	USART_pause();
}

// Just like Low power but doesn't re-init
static void Sleep_Power(void) {
	// Make sure actually changing
	if (stm_power_state == POWER_STATE_GOING_SLEEP) {
		return;
	}

	pause_peripherals();

	// Set HSI (instead of PLL) as SYSCLK source
	RCC_SYSCLKConfig(RCC_SYSCLKSource_HSI);

	// Spin waiting for HSI to be used.
	while ( RCC_GetSYSCLKSource() != 0x00 ) { ; }

	// Disable (now unused) PLL
	RCC_PLLCmd(DISABLE);

	// Set Bus speeds
	RCC_HCLKConfig(RCC_SYSCLK_Div1);  // 8 MHz
	RCC_PCLK1Config(RCC_HCLK_Div1);   // 8 MHz
	RCC_PCLK2Config(RCC_HCLK_Div1);   // 8 MHz
	RCC_ADCCLKConfig(RCC_PCLK2_Div2); // 4 MHz

	// Set flash speeds
	FLASH_SetLatency(FLASH_Latency_0);

	stm_power_state = POWER_STATE_GOING_SLEEP;
}

