Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/pwr/netmf_pwr.cpp
void Low_Power() {

	// Make sure actually changing
	if (stm_power_state == POWER_STATE_LOW) {
		return;
	}

	pause_peripherals();

	// Set HSI (instead of PLL) as SYSCLK source
	RCC_SYSCLKConfig(RCC_SYSCLKSource_HSI);

	// Spin waiting for HSI to be used.
	while ( RCC_GetSYSCLKSource() != 0x00 ) { ; }

	// Disable (now unused) PLL
	RCC_PLLCmd(DISABLE);

	// Set Bus speeds
	RCC_HCLKConfig(RCC_SYSCLK_Div1);  // 8 MHz
	RCC_PCLK1Config(RCC_HCLK_Div1);   // 8 MHz
	RCC_PCLK2Config(RCC_HCLK_Div1);   // 8 MHz
	RCC_ADCCLKConfig(RCC_PCLK2_Div2); // 4 MHz

	// Set timer prescaler for constant 8 MHz
	// Very not tested
	TIM_PrescalerConfig(TIM1, 0, TIM_PSCReloadMode_Immediate);

	// Set flash speeds
	FLASH_SetLatency(FLASH_Latency_0);

	stm_power_state = POWER_STATE_LOW;

	USART_reinit(); // Clock sensitive. Must redo.
}

void Mid_Power() {

	// Make sure actually changing
	if (stm_power_state == POWER_STATE_MID) {
		return;
	}

	pause_peripherals();

	// Set HSI (instead of PLL) as SYSCLK source
	RCC_SYSCLKConfig(RCC_SYSCLKSource_HSI);
	while ( RCC_GetSYSCLKSource() != 0x00 ) { ; }
	RCC_PLLCmd(DISABLE);

	// Setup PLL for 8/2*6 = 24 MHz
	RCC_PLLConfig(RCC_PLLSource_HSI_Div2, RCC_PLLMul_6);

	// Set timer prescaler for constant 8 MHz
	// Only TIM1 needed, TIM2 is slave
	// PCLK @ 24 MHz, TIM runs x1, so /3
	TIM_PrescalerConfig(TIM1, 2, TIM_PSCReloadMode_Immediate);

	// Set Bus Speeds
	RCC_HCLKConfig(RCC_SYSCLK_Div1);  // 24 MHz
	RCC_PCLK1Config(RCC_HCLK_Div1);   // 24 MHz
	RCC_PCLK2Config(RCC_HCLK_Div1);   // 24 MHz
	RCC_ADCCLKConfig(RCC_PCLK2_Div4); // 6 MHz

	// This is confusing, pay attention:
	// If the PCLK1/2 prescaler != 1
	// Then the associated TIM clock is x2
	// so PCLK @ 48/2 MHz really means TIM @ 48 MHz.

	// Set flash speeds
	FLASH_SetLatency(FLASH_Latency_0);

	// Enable PLL and spin waiting for PLL ready
	RCC_PLLCmd(ENABLE);
	while ( RCC_GetFlagStatus(RCC_FLAG_PLLRDY) == RESET ) { ; }

	// Set PLL as clock source and spin waiting for active
	RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);
	while ( RCC_GetSYSCLKSource() != 0x08 ) { ; }

	stm_power_state = POWER_STATE_MID;

	USART_reinit(); // Clock sensitive. Must redo.
}

void High_Power() {

	// Make sure actually changing
	if (stm_power_state == POWER_STATE_HIGH) {
		return;
	}

	pause_peripherals();

	// Set HSI (instead of PLL) as SYSCLK source
	RCC_SYSCLKConfig(RCC_SYSCLKSource_HSI);
	while ( RCC_GetSYSCLKSource() != 0x00 ) { ; }
	RCC_PLLCmd(DISABLE);

	// Setup PLL for 8/2*16 = 64 MHz
	RCC_PLLConfig(RCC_PLLSource_HSI_Div2, RCC_PLLMul_16);

	// Set timer prescaler for constant 8 MHz
	// Only TIM1 needed, TIM2 is slave
	// PCLK @ 32 MHz, TIM runs x2, so /8
	TIM_PrescalerConfig(TIM1, 7, TIM_PSCReloadMode_Immediate);

	// Set Bus Speeds
	RCC_HCLKConfig(RCC_SYSCLK_Div1);  // 64 MHz
	RCC_PCLK1Config(RCC_HCLK_Div2);   // 32 MHz
	RCC_PCLK2Config(RCC_HCLK_Div2);   // 32 MHz
	RCC_ADCCLKConfig(RCC_PCLK2_Div6); // 10.67 MHz

	// This is confusing, pay attention:
	// If the PCLK1/2 prescaler != 1
	// Then the associated TIM clock is x2
	// so PCLK @ 48/2 MHz really means TIM @ 48 MHz.

	// Set flash speed
	FLASH_SetLatency(FLASH_Latency_2);

	// Enable PLL and spin waiting for PLL ready
	RCC_PLLCmd(ENABLE);
	while ( RCC_GetFlagStatus(RCC_FLAG_PLLRDY) == RESET ) { ; }

	// Set PLL as clock source and spin waiting for active
	RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);
	while ( RCC_GetSYSCLKSource() != 0x08 ) { ; }

	stm_power_state = POWER_STATE_HIGH;

	USART_reinit(); // Clock sensitive. Must redo.
}

UINT8 Get_CurrentPower(){
	return stm_power_state;
}
static bool check_pending_isr(void) {
	const volatile unsigned icsr = *((volatile unsigned *)0xE000ED04);
	const unsigned ISRPENDING_MASK = 1<<22;
	return (icsr & ISRPENDING_MASK);
}

static bool usart_tx_busy(void) {
	bool ret = false;
	for (int i=0; i<TOTAL_USART_PORT; i++) {
		ret = ret | CPU_USART_TxBufferEmptyInterruptState(i);
	}
	return ret;
}

static uint32_t check_all_exti(void) {
	uint32_t ret = 0;
	uint32_t line = EXTI_Line0;
	for (uint32_t line = EXTI_Line0; line < EXTI_Line18; line = line << 1) {
		if (EXTI_GetFlagStatus(line) == SET || EXTI_GetITStatus(line) == SET)
			ret += line;
	}
	return ret;
}

// Returns the first IRQn which is active.
// *probably* the one that woke us up, but impossible to tell.
static IRQn_Type get_first_irq(void) {
	if (NVIC_GetPendingIRQ(RTC_IRQn) == 1)
		return RTC_IRQn;	// This is what we want to see.

	if (RTC_GetFlagStatus(RTC_FLAG_ALR) == SET )
		return RTCAlarm_IRQn; // Alarm is an event so it doesn't show up as IRQ. If its set, we assume this woke us up.

	int exti =  check_all_exti();
	if (exti > 0) {
		//SOFT_BREAKPOINT();
		return (IRQn_Type)(EXTI_Line18+exti);
	}

	for (int i=0; i<60; i++) {
		if (NVIC_GetPendingIRQ((IRQn_Type)i) == 1)
			return (IRQn_Type)i;
	}

	return (IRQn_Type)0xFFFF; // Shouldn't happen???
}

// Only to be called with interrupts disabled
static uint32_t align_to_rtc2(void) {
	uint32_t now = RTC_GetCounter();
	while (RTC_GetCounter() == now) ; // align by waiting until we tick
	return now+1;
}

void Snooze() {
#ifdef POWER_PROFILE_HACK
	uint32_t now = RTC_GetCounter();
#endif
	__DSB();
	__WFI();
#ifdef POWER_PROFILE_HACK
	uint32_t later = RTC_GetCounter();
	power_event_add(now, SNOOZE, later-now, 0);
#endif
}

// Exit in the same power state as we entered.
// TODO: Need to clean this up...
void Sleep() {

	//USART_Flush(0); // Doesn't work when we're locked, derp
	// No deep sleep while TX bytes are in the queue.
	if ( usart_tx_busy() ) {
#ifdef POWER_PROFILE_HACK
		power_event_add(RTC_GetCounter(), BUSY_USART, 0, -1);
#endif
		__DSB();
		__WFI();
		return;
	}

#ifdef EMOTE_WAKELOCKS
	if ( GetWakeLocked() ) { // If wakelocked, use snooze mode.
#ifdef POWER_PROFILE_HACK
		power_event_add(RTC_GetCounter(), WAKELOCK_DENY_START, 0, -1);
#endif
		__DSB();
		__WFI();
#ifdef POWER_PROFILE_HACK
		power_event_add(RTC_GetCounter(), WAKELOCK_DENY_END, (uint16_t)get_first_irq(), -1);
#endif
		return; // Sleep completed, done here.
	}
#endif // EMOTE_WAKELOCKS

	// Dummy event, to make sure we are clear
	ASSERT_IRQ_MUST_BE_OFF();
	__SEV();
	__WFE();
	NVIC_SystemLPConfig(NVIC_LP_SEVONPEND, ENABLE);

	if (check_pending_isr()) { // Must ensure something didn't slip in
		NVIC_SystemLPConfig(NVIC_LP_SEVONPEND, DISABLE);
		__SEV();
		__WFE();
#ifdef POWER_PROFILE_HACK
		power_event_add(RTC_GetCounter(), BUSY_ISR, (uint16_t)get_first_irq(), -1);
#endif
		return;
	}

	uint32_t now; // 32-bits can store about 90 days worth of ticks
	uint32_t aft; // post sleep RTC time;
	uint32_t wakeup_time; // when the RTC is supposed to wake us up.

	// Abort if our wakeup time is too soon
	now = RTC_GetCounter();
	wakeup_time = g_STM32F10x_RTC.GetCompare();
	if(wakeup_time < now+MIN_SLEEP_TICKS) {
		// Abort!
		SOFT_BREAKPOINT();
		NVIC_SystemLPConfig(NVIC_LP_SEVONPEND, DISABLE);
		__SEV();
		__WFE();
#ifdef POWER_PROFILE_HACK
		if ( wakeup_time < now )
			power_event_add(now, TIMEWARP, now-wakeup_time, -1);
		else
			power_event_add(now, TOO_SHORT, wakeup_time-now, -1);
#endif
		return;
	}

#ifdef POWER_PROFILE_HACK
	power_event_sleep(now, wakeup_time-now, stm_power_state);
#endif

