Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/pwr/netmf_pwr.cpp
	switch(stm_power_state) {
		default:
		case POWER_STATE_LOW:
			RTC_WaitForLastTask();
			RTC_SetAlarm(wakeup_time-SLEEP_EXTRA_PAD-SLEEP_PADDING_LOW_POWER);
			RTC_WaitForLastTask();
			now = align_to_rtc2();
			TIM_Cmd(TIM1, DISABLE);
			Sleep_Power();
			rtc_alr_evt_enable();
			PWR_EnterSTOPMode(PWR_Regulator_ON, PWR_STOPEntry_WFE);
			RTC_WaitForSynchro();
			aft = RTC_GetCounter(); // align_to_rtc2() not needed because redundant with WaitForSyncrho() but ONLY FOR LOW-POWER CASE
			TIM_Cmd(TIM1, ENABLE);
			stm_power_state = POWER_STATE_LOW; // Low_Power is basically identical to Sleep_Power, so basically a no-op.
			break;
		case POWER_STATE_MID:
			RTC_WaitForLastTask();
			RTC_SetAlarm(wakeup_time-SLEEP_EXTRA_PAD-SLEEP_PADDING_MID_POWER);
			RTC_WaitForLastTask();
			now = align_to_rtc2();
			TIM_Cmd(TIM1, DISABLE);
			Sleep_Power();
			rtc_alr_evt_enable();
			PWR_EnterSTOPMode(PWR_Regulator_ON, PWR_STOPEntry_WFE);
			Mid_Power();
			RTC_WaitForSynchro();
			aft = align_to_rtc2();
			TIM_Cmd(TIM1, ENABLE);
			break;
		case POWER_STATE_HIGH:
			RTC_WaitForLastTask();
			RTC_SetAlarm(wakeup_time-SLEEP_EXTRA_PAD-SLEEP_PADDING_HIGH_POWER);
			RTC_WaitForLastTask();
			now = align_to_rtc2();
			TIM_Cmd(TIM1, DISABLE);
			Sleep_Power();
			rtc_alr_evt_enable();
			PWR_EnterSTOPMode(PWR_Regulator_ON, PWR_STOPEntry_WFE);
			High_Power();
			RTC_WaitForSynchro();
			aft = align_to_rtc2();
			TIM_Cmd(TIM1, ENABLE);
			break;
	}

	rtc_alr_evt_disable();

#ifdef POWER_PROFILE_HACK
	power_event_wakeup(aft);
#endif

	// Disable SEVONPEND and create-consume a dummy event.
	NVIC_SystemLPConfig(NVIC_LP_SEVONPEND, DISABLE);
	__SEV();
	__WFE();

	// Main system timer does not run during sleep so we have to fix up clock afterwards.
	// Do a three iteration floor estimate for the clock conversion.
	// Basically this is "leap ticks" and avoids both floating point and long division.
	uint32_t ticks;			 			  // 1st iteration
	if (aft >= now) { ticks = aft-now; }  // Check for roll-over
	else { ticks = aft-now+0xFFFFFFFF; }
	uint32_t ticks_extra;
	static uint32_t ticks_carried  = 0;  // 2nd iteration
	static uint32_t ticks_carried3  = 0; // 3nd iteration
	// 2nd iteration, every 62.5ms
	ticks_extra = (ticks+ticks_carried) / 2048;
	ticks_carried = (ticks+ticks_carried) % 2048;
	// 3rd iteration, every 8 seconds
	ticks_extra += (ticks_extra+ticks_carried3)/128 * 23;
	ticks_carried3 = (ticks_extra+ticks_carried3) % 128;
	// Add it up
	ticks = (ticks+ticks_extra) * 305 * 2; // *2 because of change from 32k to 16k
	// Punch it in
	HAL_Time_AddClockTime(ticks);

	// Long term numerical error should be 312.5 ppb
	// Typical short term error of 1 tick (~30.5us) but max of 24 ticks (~732 us).
	// Long term error is about right for a 5-10ppm source (~10x better) but a real source of error if <= 1ppm.
	// Then again, the HSI contributes too and is something like 50,000 ppm so this is fundamentally broken anyway

	//irq.Release(); // Should already be locked from caller
}

// Shouldn't be used, possibly for unrecoverable error in debug mode.
void Halt() {
    SOFT_BREAKPOINT();
	while(1);
}

void Reset() {
	__disable_irq();
	NVIC_SystemReset();
	while(1);
}

void Shutdown() {
    SOFT_BREAKPOINT();
	while(1) { PWR_EnterSTANDBYMode(); }
}

void HAL_AssertEx() {
#if !defined(NDEBUG)
	if(JTAG_Attached()) {
		SOFT_BREAKPOINT(); // use SOFT_BREAKPOINT() because there are too many assertions being thrown, and some assertions might be false positives due to other companies submitting junk to CodePlex.
	}
	return;
#endif
}
